app/controllers/xml_sender_controller.rb

SELECT "QUEUE_MANAGERS"."MANAGER_NAME" FROM "QUEUE_MANAGERS" WHERE ("QUEUE_MANAGERS"."USER_ID" = :a1 OR "QUEUE_MANAGERS"."VISIBLE_ALL" = :a2) ORDER BY manager_name  [["user_id", 10000], ["visible_all", "1"]]
SELECT "PRODUCTS".* FROM "PRODUCTS" ORDER BY product_name
SELECT "CATEGORIES".* FROM "CATEGORIES" ORDER BY "CATEGORIES"."CATEGORY_NAME" ASC
---
  def index
    logged_in? ? @qm = QueueManager.where(user_id: current_user.id).or(QueueManager.where(visible_all: true)).order('manager_name').pluck(:manager_name) : @qm = QueueManager.where(visible_all: true).pluck(:manager_name)
    @product = Product.all.order('product_name')
    @category = Category.all.order(category_name: :asc)

SELECT  "QUEUE_MANAGERS".* FROM "QUEUE_MANAGERS" WHERE "QUEUE_MANAGERS"."MANAGER_NAME" = :a1 AND ROWNUM <= :a2   [["manager_name", "WMQ"], ["LIMIT", 1]]
---
  def manager_choise # Заполнение параметров менеджера очередей
    new_params = params.require(:manager).permit(:manager_name)
    response_ajax("Не выбраны настройки MQ из списка") and return if !get_empty_values(new_params).empty?
    select_manager = QueueManager.find_by_manager_name(params[:manager][:manager_name])